backend/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."published" = ?  [["published", 1]]
SELECT "articles".* FROM "articles"
---
  def index
    if params[:published].present?
      if params[:published] == "true"
        @articles = Article.where(published: true)
      elsif params[:published] == "false"
        @articles = Article.where(published: false)
      else
        @articles = Article.all
      end
    else
      @articles = Article.all

INSERT INTO "articles" ("title", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "asdasdas"], ["body", "asdasdad"], ["published", nil], ["created_at", "2024-05-05 12:00:59.630042"], ["updated_at", "2024-05-05 12:00:59.630042"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "title" = ?, "body" = ?, "published" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "qweqwe"], ["body", "rewrwe"], ["published", 0], ["updated_at", "2024-05-05 13:26:42.580007"], ["id", 40]]
---
  def update
    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 46]]
---
  def destroy
    @article.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]
---
  def set_article
    @article = Article.find(params[:id])